<template>
  <el-main>
    <div class="user-title">
      场馆介绍
    </div>
    <div class="main-card" v-for="revenue in revenues" :key="revenue.id">
      <el-card class="box-card" shadow="hover">
        <div slot="header" class="headline">
          <div class="name">{{ revenue.name }}</div>
          <div class="price">单价：{{ revenue.price }}元/时</div>
        </div>
        {{ revenue.intro }}
      </el-card>
    </div>
  </el-main>
</template>

<script>
    export default {
        name: "userRevenue",
        data () {
            return {
                revenues: [{
                    name: "篮球",
                    price: "55",
                    intro: "这是篮球馆.普林斯顿大学的愿景是希望建立美国最优秀的高校体育场，以取代原有恶化并无法修复的Palmer体育馆。普林斯顿大学要求球场有足够的灵活性，以适应如橄榄球，足球，曲棍球以及田径等需要大空间的体育赛事，并成为可满足全年服务的设施。\n" +
                        "\n" +
                        "原有的体育馆由铁丝网包围，因为普林斯顿大学从前每年只安排六场橄榄球比赛，所以球场的座位大部分时间都是空的。另外，球场座位下面通常是阴暗而毫无吸引力的区域，常用以堆放体育场的服务设施。新的体育场中，建筑外围墙空间和观众大门休息区之间的空间被设计成一个大学内吸引人的场所，供全年使用。通过将服务功能转移到建筑墙体中，将自然光引入流线，并且将大量的植物带入空间，创建了一种新的覆顶公共空间，可以让人享受独立的体育赛事。同时建筑也是一个综合性体育设施，可用于足球，美式足球和曲棍球，和靠近跑道和球场设施的观众席。\n" +
                        "\n" +
                        "在规划的过程中，对校园的形式，学术环境和文化背景依照项目要求进行了分析。由此，三种组织形式下的 27个体育馆设计被发展和分析，并与教师，学生和工作人员一起进行详细的讨论。根据这些讨论，81个设计备选方案被缩减到11个，再缩减为2个。建筑在1998年8月的足球赛季开始时完成施工。" +
                        "\n" +
                        "原有的体育馆由铁丝网包围，因为普林斯顿大学从前每年只安排六场橄榄球比赛，所以球场的座位大部分时间都是空的。另外，球场座位下面通常是阴暗而毫无吸引力的区域，常用以堆放体育场的服务设施。新的体育场中，建筑外围墙空间和观众大门休息区之间的空间被设计成一个大学内吸引人的场所，供全年使用。通过将服务功能转移到建筑墙体中，将自然光引入流线，并且将大量的植物带入空间，创建了一种新的覆顶公共空间，可以让人享受独立的体育赛事。同时建筑也是一个综合性体育设施，可用于足球，美式足球和曲棍球，和靠近跑道和球场设施的观众席。\n" +
                        "\n",
                },{
                    name: "排球",
                    price: "40",
                    intro: "这是排球馆.普林斯顿大学的愿景是希望建立美国最优秀的高校体育场，以取代原有恶化并无法修复的Palmer体育馆。普林斯顿大学要求球场有足够的灵活性，以适应如橄榄球，足球，曲棍球以及田径等需要大空间的体育赛事，并成为可满足全年服务的设施。\n" +
                        "\n" +
                        "原有的体育馆由铁丝网包围，因为普林斯顿大学从前每年只安排六场橄榄球比赛，所以球场的座位大部分时间都是空的。另外，球场座位下面通常是阴暗而毫无吸引力的区域，常用以堆放体育场的服务设施。新的体育场中，建筑外围墙空间和观众大门休息区之间的空间被设计成一个大学内吸引人的场所，供全年使用。通过将服务功能转移到建筑墙体中，将自然光引入流线，并且将大量的植物带入空间，创建了一种新的覆顶公共空间，可以让人享受独立的体育赛事。同时建筑也是一个综合性体育设施，可用于足球，美式足球和曲棍球，和靠近跑道和球场设施的观众席。\n" +
                        "\n" +
                        "原有的体育馆由铁丝网包围，因为普林斯顿大学从前每年只安排六场橄榄球比赛，所以球场的座位大部分时间都是空的。另外，球场座位下面通常是阴暗而毫无吸引力的区域，常用以堆放体育场的服务设施。新的体育场中，建筑外围墙空间和观众大门休息区之间的空间被设计成一个大学内吸引人的场所，供全年使用。通过将服务功能转移到建筑墙体中，将自然光引入流线，并且将大量的植物带入空间，创建了一种新的覆顶公共空间，可以让人享受独立的体育赛事。同时建筑也是一个综合性体育设施，可用于足球，美式足球和曲棍球，和靠近跑道和球场设施的观众席。\n" +
                        "\n",
                }],
            }
        },
    }
</script>

<style scoped>
  .user-title {
    text-align: center;
    font-size: 30px;
    margin: 20px 0 40px;
    color: #303133;
  }

  .main-card {
    margin: 0 auto;
    max-width: 800px;
    width: 70%;
  }

  .box-card {
    width: 100%;
    min-height: 400px;
    text-align: left;
    margin: 10px;
  }

  .headline {
    display: flex;
    flex-direction: row;
    height: 1.5em;
    font-size: 20px;
  }

  .name {
    flex-grow: 3;
    margin-right: 10px;
    text-align: left;
  }

  .price {
    flex-grow: 1;
    margin-left: 10px;
    text-align: right;
  }



</style>
